# GetWallPathType

## Description
Gets the path type of a wall.

```pascal
FUNCTION GetWallPathType(wall : HANDLE): INTEGER;
```

```python
def vs.GetWallPathType(wall):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|wall|HANDLE|The wall.|

## Version
Availability: from Vectorworks 2022

## Category
* Objects - Walls